<?
	//ใช้ในฟอร์มส่งเมล์ เพื่อเป็นตัวบอกว่า ส่งเมล์จากเว็บคุณ และยังใช้ในหน้าเว็บบอร์ด เพื่อทำลิงค์กลับด้วย ต้องมี / ปิดท้าย
	$config[url] = "http://surat.nfe.go.th/"; 

	//ใส่อีเมล์ของคุณสำหรับ รับอีเมล์ ที่ถูกตีกลับ หากอีเมล์ที่ส่งจากฟอร์มส่งเมล์ ไม่ถูกต้อง
	$config[email] ="rhce.system@gmail.com"; 

	//Admin Password สำหรับ ลบคำถาม - คำตอบ
	$config[adminuser] ="admin";  //$admin_user
	$config[adminpwd] ="007";  //$admin_pwd

	// ข้อความที่จะปรากฎที่ title bar ของ IE
	$config[title]="Welcome To My Webboard"; 	

	// ข้อความที่จะปรากฎที่ บนสุดของหน้าต่าง IE
	$config[txtheader]="ถามมา-ตอบไป"; 	

	// ข้อความที่จะปรากฎบรรทัด ต่อจากชื่อเว็บบอร์ด
	$config[headerdetail]="เพื่อแลกเปลี่ยนความรู้, ถาม-ตอบปัญหาคาใจ, แนะนำ, ประกาศ, หรือทุกสิ่งตามต้องการ"; 	

	// ข้อความที่จะปรากฎที่ด้านล่างของเพจ (จะมีเพียงบางหน้า)
	$config[footer]=" .:: Webboard - Data TextFile v3.22 ::. by พีกับยู ::.Modify by Rnut@surat";

	//ตั้งค่าของไฟล์หัวข้อคำถาม สามารถเปลี่ยนชื่อไฟล์ได้ตามต้องการ (ไม่ต้องเปลี่ยนแล้วก็ได้)
	$config[fileQuestion] = "webboard.txt";  // เปลี่ยนเป็นอะไรก็ได้ เช่น a.txt หรือ webboard.txt หรือ ssss.txt (สำหรับผู้ติดตั้งใหม่นะครับ) ถ้าใครใช้อยู่แล้วก็ตั้งให้ตรงกับที่มีอยู่ ซึ่งก็น่าจะเป็น toc.txt อยู่แล้ว

	// ไดเรคทอรี่ที่ใช้เก็บข้อมูลเว็บบอร์ด จะใช้ชื่ออะไรก็ได้ ภาษาอังกฤษตัวพิมพ์เล็กเท่านั้น และต้องมี / ปิดท้าย
	$config[dataDir] = "question/";
	
	//ชื่อของไดเรคทอรี่ เมื่อติดตั้งในเว็บไซต์คุณ จะต้องให้ชื่อตรงกัน เช่นในเว็บคุณใช้ http://web.com/forum/
	//ก็ต้องเปลี่ยนข้อมูลตัวนี้เป็น "forum/" ตามด้วย (ต้องมี / ปิดท้าย)
	$config[webboard] = "cty/boardtxt/";

	//กำหนดค่าสีต่างๆ ของรูปแบบเว็บบอร์ด
	$config[headColor] = "#BBBBBB"; //สีของหัวข้อเว็บบอร์ด (กระทู้ที่  กระทู้  ผู้ตั้งกระทู้  อ่าน  ตอบ)
	$config[headfontColor] ="#666666"; //สีของข้อความหัวข้อเว็บบอร์ด (กระทู้ที่  กระทู้  ผู้ตั้งกระทู้  อ่าน  ตอบ)
	$config[rowColor1] = "#FAF2E6"; //สีตาราง 1 (ในช่องแสดงคำถามที่ไฟล์ webboard.php)
	$config[rowColor2] = "#FFFFCC"; //สีตาราง 2 จะสลับกับ สีตาราง 1

	//กำหนดว่าต้องการให้ส่งรูปได้หรือเปล่า โดย	
	//0=ส่งไม่ได้		  
	//1=ส่งได้ทุกคน		
	$config[SendImageByTopic] = 1; //จากการตั้งกระทู้
	$config[SendImageByReply] = 1; //จากาการตอบกระทู้

	//ปิด หรือ เปิด การใช้ tag HTML แต่จะแลกมากับ การที่
	//ถ้าปิด tag ละก้อ... quote จะใช้ให้จะซ้อนๆๆๆ กันไม่ได้ มันจะมั่วๆ ลองไปอ่านที่กระทู้ทดสอบอีกทีครับ
	//ถ้าเปิด tag หากมีคนทราบ จะสามารถใช้ tag HTML โดยตรงได้เลย แต่ quote จะใช้ซ้อนๆๆๆ กันได้ สวยงามกว่า
	$config[tag]=1; //(1 คือ เปิด tag) , (0 คือ ปิด tag)

	// ขนาดความจุของรูปที่ผู้ใช้อัปโหลดเข้ามา (หน่วยเป็นไบต์ ใช้ 1024 x 50 == 51200 หรือ 50 Kb)
	$config[imgSize_limit] = 51200;
	$config[imgWidth] = 800; //ขนาดความกว้างของรูป ที่สามารถส่งได้ไม่เกิน...

	// ขนาดความจุของ Flash ที่ผู้ใช้อัปโหลดเข้ามา (หน่วยเป็นไบต์ ใช้ 1024 x 100 == 102400 หรือ 100 Kb)
	$config[flashSize_limit] = 102400;
	$config[flashWidth] = 600; //ขนาดความกว้างของ Flash ที่สามารถส่งได้ไม่เกิน...

	// กำหนดค่าความฮอต ว่าถ้ามีผู้ตอบกี่คน ให้เป็นกระทู้ฮอต ในที่นี้คือ 20 คนขึ้นไป
	$config[Hot] = 20;

	// ตั้งค่าการตรวจสอบการส่งรูป (เนื่องจากเวอร์ชั่นของ PHP ที่ต่างกัน)
	//ใช้เมื่อเกิดข้อผิดพลาด "ไม่ใช่ไฟล์ .jpg หรือ .gif"
	$config[chkimg] = "";  //เป็นได้ 2 กรณีคือ "none" กับ "" (ว่างเปล่า)

	// ตั้งค่าการอนุญาตให้โพสข้อความ มากสุดต่อครั้งต่อคนต่อIP (ก็คือป้องกันการโพสข้อความติดๆกัน)
	$config[flood] = 10;

	// ตั้งค่าการแสดง IP โดยมี ALL, BAN, NONE
	$config[showip] = "BAN";

	// กำหนดว่าต้องการให้กรอบข้อความของคำถามเป็นแบบโค้งหรือเป็นสี่เหลี่ยมธรรมดา โดย	0 = สี่เหลี่ยม		1 = โค้ง
	$config[BorderQ] = 0;

	// กำหนดว่าต้องการให้กรอบข้อความของคำตอบเป็นแบบโค้งหรือเป็นสี่เหลี่ยมธรรมดา โดย	0 = สี่เหลี่ยม		1 = โค้ง
	$config[BorderR] = 0;

	//  กำหนด สกุลของไฟล์ที่อนุญาต ให้ upload ได้
	$config[upfile]=array("image/gif", "image/x-png", "application/x-shockwave-flash", "image/jpeg", "image/jpg", "image/pjpeg");
	$config[typeof]=array(".gif", ".png", ".swf", ".jpg", ".jpg", ".jpg", ".pdf");

?>